app/controllers/api/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @message = Message.find(params[:id])